{
	title: "Fudgewaffe Mod",
	desc: "Release version compatible.

An additional content mod. Adds various new research, items and objects. Mainly on the end of the research tree.


Examples of added content:
Automated farms
Water pumps
Solar panels
Higher tier rituals
New research tree (for spending excess research points)
Higher tiers of some items


Electricity:
Instead of wood as fuel, recipes now use electricity.
Early on, the only means of generating electricity is a wood burning generator. (Basically, converts wood to energy 1:1)
You will need to stockpile some scrap to get it. Survivors will auto fuel it. If you run out of wood they will stop auto-fueling it. Tell them at least once manually and they will start again.


If you are having trouble keeping up with electric generation, I suggest not making bread. As in vanilla, it is a major consumer of fuel (wood, which is now electricty).

Mid game, you gain access to a distillery that can make Hydrocarbon fuel, powering a generator. This mainly uses wheat, so you need some decent farming.

Later on, getting a solar panel or two up will let you generate a small steady income of electricity that needs no further work. 8 solar panels can supply a relatively energy hungry base.


Mana:
Once you research Arcane Rituals, you gain access to create mana at occult libraries (Cancel the research task, pick the mana chant task). It will not only keep your ritualists busy, but late game it becomes an important resource.


High tech items:
Some late game items are required to make the advanced workbench, which is needed to make those items.

Meaning you will have to go scavenge the first few of them in order to start making more on your own.

I suggest getting an advanced workbench with your first few high tech items, so that you can become self sufficient once you have the technology.
But should be sufficient scavenge around that you can get away for quite some time with not making your own.

Sidenote: The high tech items are time consuming to make. Scavenging them is always good.


Other recommended mods:
I suggest playing with the Fudgewaffe and submods collection all enabled.

I also suggest playing with the Bigger Colonies mod (the one that makes your base 80x80 tiles).


Known issues:
Many placeholder graphics. Need help from an artist.

There is no 'upgrade building' option in modding. So higher tiers of the altars will clutter up the build menu. Sorry.

If you are not using the rescaled needs mod, then automated farms will produce much slower than normal farms. (They are configured as if you are using that mod).


Feedback:
Feedback would be greatly appreciated.",
	uid: "1258057538",
	visibility: "0",
	creator: "UberWaffe",
	tags: "enemies,research,items,locations",
}
